export const PAGE_SIZE = 10;

export const FIELDS = [
  'subject',
  'type',
  'sender',
  'receiver',
  'createdAt',
  'startDate',
  'responseDays',
  'status',
  'refNum',
  'notes',
  'theirRefNum',
];

export const DOCUMENTS_TYPE = [
  { value: 'outgoing', label: 'Outgoing' },
  { value: 'incoming', label: 'Incoming' },
  { value: 'localOutgoing', label: 'Local Outgoing' },
  { value: 'localIncoming', label: 'Local Incoming' },
  { value: 'private', label: 'Private' },
];

export const FILES_TYPE = [
  { value: 'file', label: 'file' },
  { value: 'Ministerial Decision', label: 'Ministerial Decision' },
  {
    value: 'Administrative Circular',
    label: 'Administrative circular',
  },
  { value: 'MOM', label: 'MOM' },
];

export const DEPARTMENT_NUM = [
  { name: 'الوزير', num: 1 },
  { name: 'النائب', num: 2 },
  { name: 'الوكيل', num: 3 },
  { name: 'وكيل الوزارة لقطاع الصناعة', num: 4 },
  { name: 'وكيل الوزارة لقطاع التجارة الداخلية', num: 5 },
  { name: 'وكيل الوزارة لقطاع التجارة الخارجية وتنمية الصادرات', num: 6 },
  { name: 'وكيل الوزارة لقطاع خدمات الأعمال', num: 7 },
  { name: 'الإدارة العامة لمكتب الوزير', num: 8 },
  { name: 'الإدارة العامة لمكتب نائب الوزير', num: 9 },
  { name: 'المكتب الفني', num: 10 },
  {
    name: 'الإدارة العامة لمكاتب الوزارة في أمانة العاصمة والمحافظات',
    num: 11,
  },
  { name: 'الإدارة العامة للمراجعة الداخلية', num: 12 },
  {
    name: 'الإدارة العامة للهيئات والمؤسسات العامة والشركات المختلطة والتنظيمات المهنية',
    num: 13,
  },
  { name: 'الإدارة العامة لتنمية الموارد البشرية', num: 14 },
  { name: 'الإدارة العامة للمرأة', num: 15 },
  { name: 'الإدارة العامة للشؤون القانونية', num: 16 },
  { name: 'الإدارة العامة للتخطيط والمعلومات', num: 17 },
  { name: 'الإدارة العامة للشؤون المالية والتجهيزات', num: 18 },
  { name: 'الإدارة العامة للعلاقات العامة والإعلام', num: 19 },
  { name: 'الإدارة العامة لنظم المعلومات', num: 20 },
  { name: 'مكتب الاتصال والتنسيق مع منظمة التجارة العالمية', num: 21 },
  { name: 'الإدارة العامة للمناطق الصناعية', num: 22 },
  { name: 'الإدارة العامة للتنمية الصناعية والاستثمار', num: 23 },
  { name: 'الإدارة العامة للرقابة الصناعية', num: 24 },
  { name: 'الإدارة العامة للصناعات الصغيرة', num: 25 },
  { name: 'الإدارة العامة لاستقرار الأسواق', num: 26 },
  { name: 'الإدارة العامة لحماية المستهلك', num: 27 },
  { name: 'الإدارة العامة للمنافسة ومنع الاحتكار', num: 28 },
  { name: 'غرفة العمليات', num: 29 },
  { name: 'الإدارة العامة للعلاقات التجاريةالدولية', num: 30 },
  { name: 'الإدارة العامة لتنمية الصادرات', num: 31 },
  { name: 'الإدارة العامة لحماية المنتجات الوطنية', num: 32 },
  { name: 'الإدارة العامة للاتفاقيات والمناطق التجارية', num: 33 },
  { name: 'الإدارة العامة للشركات', num: 34 },
  {
    name: 'الإدارة العامة للوكالات وفروع الشركات والبيوت الأجنبية',
    num: 35,
  },
  { name: 'الإدارة العامة للسجل التجاري والأسماء التجارية', num: 36 },
  { name: 'الإدارة العامة لحماية الملكية الفكرية والعلامات', num: 37 },
  { name: 'الإدارة العامة لتنظيم مهنة تدقيق ومراجعة الحسابات', num: 38 },
  { name: 'الإدارة العامة لشركات التأمين', num: 39 },
  { name: 'الإدارة العامة لخدمة العملاء', num: 40 },
];

export const DEPARTMENTS = [
  { value: 'الوزير', label: 'الوزير' },
  { value: 'النائب', label: 'النائب' },
  { value: 'الوكيل', label: 'الوكيل' },
  { value: 'وكيل الوزارة لقطاع الصناعة', label: 'وكيل الوزارة لقطاع الصناعة' },
  {
    value: 'وكيل الوزارة لقطاع التجارة الداخلية',
    label: 'وكيل الوزارة لقطاع التجارة الداخلية',
  },
  {
    value: 'وكيل الوزارة لقطاع التجارة الخارجية وتنمية الصادرات',
    label: 'وكيل الوزارة لقطاع التجارة الخارجية وتنمية الصادرات',
  },
  {
    value: 'وكيل الوزارة لقطاع خدمات الأعمال',
    label: 'وكيل الوزارة لقطاع خدمات الأعمال',
  },
  {
    value: 'الإدارة العامة لمكتب الوزير',
    label: 'الإدارة العامة لمكتب الوزير',
  },
  {
    value: 'الإدارة العامة لمكتب نائب الوزير',
    label: 'الإدارة العامة لمكتب نائب الوزير',
  },

  { value: 'المكتب الفني', label: 'المكتب الفني' },
  {
    value: 'الإدارة العامة لمكاتب الوزارة في أمانة العاصمة والمحافظات',
    label: 'الإدارة العامة لمكاتب الوزارة في أمانة العاصمة والمحافظات',
  },
  {
    value: 'الإدارة العامة للمراجعة الداخلية',
    label: 'الإدارة العامة للمراجعة الداخلية',
  },
  {
    value:
      'الإدارة العامة للهيئات والمؤسسات العامة والشركات المختلطة والتنظيمات المهنية',
    label:
      'الإدارة العامة للهيئات والمؤسسات العامة والشركات المختلطة والتنظيمات المهنية',
  },
  {
    value: 'الإدارة العامة لتنمية الموارد البشرية',
    label: 'الإدارة العامة لتنمية الموارد البشرية',
  },
  { value: 'الإدارة العامة للمرأة', label: 'الإدارة العامة للمرأة' },
  {
    value: 'الإدارة العامة للشؤون القانونية',
    label: 'الإدارة العامة للشؤون القانونية',
  },
  {
    value: 'الإدارة العامة للتخطيط والمعلومات',
    label: 'الإدارة العامة للتخطيط والمعلومات',
  },
  {
    value: 'الإدارة العامة للشؤون المالية والتجهيزات',
    label: 'الإدارة العامة للشؤون المالية والتجهيزات',
  },
  {
    value: 'الإدارة العامة للعلاقات العامة والإعلام',
    label: 'الإدارة العامة للعلاقات العامة والإعلام',
  },
  {
    value: 'الإدارة العامة لنظم المعلومات',
    label: 'الإدارة العامة لنظم المعلومات',
  },
  {
    value: 'مكتب الاتصال والتنسيق مع منظمة التجارة العالمية',
    label: 'مكتب الاتصال والتنسيق مع منظمة التجارة العالمية',
  },
  {
    value: 'الإدارة العامة للمناطق الصناعية',
    label: 'الإدارة العامة للمناطق الصناعية',
  },
  {
    value: 'الإدارة العامة للتنمية الصناعية والاستثمار',
    label: 'الإدارة العامة للتنمية الصناعية والاستثمار',
  },
  {
    value: 'الإدارة العامة للرقابة الصناعية',
    label: 'الإدارة العامة للرقابة الصناعية',
  },
  {
    value: 'الإدارة العامة للصناعات الصغيرة',
    label: 'الإدارة العامة للصناعات الصغيرة',
  },
  {
    value: 'الإدارة العامة لاستقرار الأسواق',
    label: 'الإدارة العامة لاستقرار الأسواق',
  },
  {
    value: 'الإدارة العامة لحماية المستهلك',
    label: 'الإدارة العامة لحماية المستهلك',
  },
  {
    value: 'الإدارة العامة للمنافسة ومنع الاحتكار',
    label: 'الإدارة العامة للمنافسة ومنع الاحتكار',
  },
  { value: 'غرفة العمليات', label: 'غرفة العمليات' },
  {
    value: 'الإدارة العامة للعلاقات التجارية والدولية',
    label: 'الإدارة العامة للعلاقات التجارية والدولية',
  },
  {
    value: 'الإدارة العامة لتنمية الصادرات',
    label: 'الإدارة العامة لتنمية الصادرات',
  },
  {
    value: 'الإدارة العامة لحماية المنتجات الوطنية',
    label: 'الإدارة العامة لحماية المنتجات الوطنية',
  },
  {
    value: 'الإدارة العامة للاتفاقيات والمناطق التجارية',
    label: 'الإدارة العامة للاتفاقيات والمناطق التجارية',
  },
  { value: 'الإدارة العامة للشركات', label: 'الإدارة العامة للشركات' },
  {
    value: 'الإدارة العامة للوكالات وفروع الشركات والبيوت الأجنبية',
    label: 'الإدارة العامة للوكالات وفروع الشركات والبيوت الأجنبية',
  },
  {
    value: 'الإدارة العامة للسجل التجاري والأسماء التجارية',
    label: 'الإدارة العامة للسجل التجاري والأسماء التجارية',
  },
  {
    value: 'الإدارة العامة لحماية الملكية الفكرية والعلامات',
    label: 'الإدارة العامة لحماية الملكية الفكرية والعلامات',
  },
  {
    value: 'الإدارة العامة لتنظيم مهنة تدقيق ومراجعة الحسابات',
    label: 'الإدارة العامة لتنظيم مهنة تدقيق ومراجعة الحسابات',
  },
  {
    value: 'الإدارة العامة لشركات التأمين',
    label: 'الإدارة العامة لشركات التأمين',
  },
  {
    value: 'الإدارة العامة لخدمة العملاء',
    label: 'الإدارة العامة لخدمة العملاء',
  },
];

export const DEPARTMENTS_FOR_EMPLOYEE = [
  { value: '', label: 'Select...' },
  {
    value: 'الإدارة العامة لمكتب الوزير',
    label: 'الإدارة العامة لمكتب الوزير',
  },
  {
    value: 'الإدارة العامة لمكتب نائب الوزير',
    label: 'الإدارة العامة لمكتب نائب الوزير',
  },
  {
    value: 'سكرتارية الوزارة',
    label: 'سكرتارية الوزارة',
  },

  { value: 'مكتب الوكيل', label: 'مكتب الوكيل' },
  { value: 'وكيل الوزارة لقطاع الصناعة', label: 'وكيل الوزارة لقطاع الصناعة' },
  {
    value: 'وكيل الوزارة لقطاع التجارة الداخلية',
    label: 'وكيل الوزارة لقطاع التجارة الداخلية',
  },
  {
    value: 'وكيل الوزارة لقطاع التجارة الخارجية وتنمية الصادرات',
    label: 'وكيل الوزارة لقطاع التجارة الخارجية وتنمية الصادرات',
  },
  {
    value: 'وكيل الوزارة لقطاع خدمات الأعمال',
    label: 'وكيل الوزارة لقطاع خدمات الأعمال',
  },

  { value: 'المكتب الفني', label: 'المكتب الفني' },
  {
    value: 'الإدارة العامة لمكاتب الوزارة في أمانة العاصمة والمحافظات',
    label: 'الإدارة العامة لمكاتب الوزارة في أمانة العاصمة والمحافظات',
  },
  {
    value: 'الإدارة العامة للمراجعة الداخلية',
    label: 'الإدارة العامة للمراجعة الداخلية',
  },
  {
    value:
      'الإدارة العامة للهيئات والمؤسسات العامة والشركات المختلطة والتنظيمات المهنية',
    label:
      'الإدارة العامة للهيئات والمؤسسات العامة والشركات المختلطة والتنظيمات المهنية',
  },
  {
    value: 'الإدارة العامة لتنمية الموارد البشرية',
    label: 'الإدارة العامة لتنمية الموارد البشرية',
  },
  { value: 'الإدارة العامة للمرأة', label: 'الإدارة العامة للمرأة' },
  {
    value: 'الإدارة العامة للشؤون القانونية',
    label: 'الإدارة العامة للشؤون القانونية',
  },
  {
    value: 'الإدارة العامة للتخطيط والمعلومات',
    label: 'الإدارة العامة للتخطيط والمعلومات',
  },
  {
    value: 'الإدارة العامة للشؤون المالية والتجهيزات',
    label: 'الإدارة العامة للشؤون المالية والتجهيزات',
  },
  {
    value: 'الإدارة العامة للعلاقات العامة والإعلام',
    label: 'الإدارة العامة للعلاقات العامة والإعلام',
  },
  {
    value: 'الإدارة العامة لنظم المعلومات',
    label: 'الإدارة العامة لنظم المعلومات',
  },
  {
    value: 'مكتب الاتصال والتنسيق مع منظمة التجارة العالمية',
    label: 'مكتب الاتصال والتنسيق مع منظمة التجارة العالمية',
  },
  {
    value: 'الإدارة العامة للمناطق الصناعية',
    label: 'الإدارة العامة للمناطق الصناعية',
  },
  {
    value: 'الإدارة العامة للتنمية الصناعية والاستثمار',
    label: 'الإدارة العامة للتنمية الصناعية والاستثمار',
  },
  {
    value: 'الإدارة العامة للرقابة الصناعية',
    label: 'الإدارة العامة للرقابة الصناعية',
  },
  {
    value: 'الإدارة العامة للصناعات الصغيرة',
    label: 'الإدارة العامة للصناعات الصغيرة',
  },
  {
    value: 'الإدارة العامة لاستقرار الأسواق',
    label: 'الإدارة العامة لاستقرار الأسواق',
  },
  {
    value: 'الإدارة العامة لحماية المستهلك',
    label: 'الإدارة العامة لحماية المستهلك',
  },
  {
    value: 'الإدارة العامة للمنافسة ومنع الاحتكار',
    label: 'الإدارة العامة للمنافسة ومنع الاحتكار',
  },
  { value: 'غرفة العمليات', label: 'غرفة العمليات' },
  {
    value: 'الإدارة العامة للعلاقات التجارية والدولية',
    label: 'الإدارة العامة للعلاقات التجارية والدولية',
  },
  {
    value: 'الإدارة العامة لتنمية الصادرات',
    label: 'الإدارة العامة لتنمية الصادرات',
  },
  {
    value: 'الإدارة العامة لحماية المنتجات الوطنية',
    label: 'الإدارة العامة لحماية المنتجات الوطنية',
  },
  {
    value: 'الإدارة العامة للاتفاقيات والمناطق التجارية',
    label: 'الإدارة العامة للاتفاقيات والمناطق التجارية',
  },
  { value: 'الإدارة العامة للشركات', label: 'الإدارة العامة للشركات' },
  {
    value: 'الإدارة العامة للوكالات وفروع الشركات والبيوت الأجنبية',
    label: 'الإدارة العامة للوكالات وفروع الشركات والبيوت الأجنبية',
  },
  {
    value: 'الإدارة العامة للسجل التجاري والأسماء التجارية',
    label: 'الإدارة العامة للسجل التجاري والأسماء التجارية',
  },
  {
    value: 'الإدارة العامة لحماية الملكية الفكرية والعلامات',
    label: 'الإدارة العامة لحماية الملكية الفكرية والعلامات',
  },
  {
    value: 'الإدارة العامة لتنظيم مهنة تدقيق ومراجعة الحسابات',
    label: 'الإدارة العامة لتنظيم مهنة تدقيق ومراجعة الحسابات',
  },
  {
    value: 'الإدارة العامة لشركات التأمين',
    label: 'الإدارة العامة لشركات التأمين',
  },
  {
    value: 'الإدارة العامة لخدمة العملاء',
    label: 'الإدارة العامة لخدمة العملاء',
  },
];
